app/views/todo_items/index.html.erb

<table class="todo_items">
  <% @todo_list.todo_items.each do |todo_item| %>
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 1]]