app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.new(todo_item_params)
    if @todo_item.save
---
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Milk"], ["created_at", Sat, 29 Nov 2014 18:12:48 UTC +00:00], ["todo_list_id", 1], ["updated_at", Sat, 29 Nov 2014 18:12:48 UTC +00:00]]

  def edit
    @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", "1"]]

  def update
    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.update_attributes(todo_item_params)
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", "1"]]
UPDATE "todo_items" SET "content" = ?, "updated_at" = ? WHERE "todo_items"."id" = 1  [["content", "Lots of Milk"], ["updated_at", Sat, 29 Nov 2014 18:14:44 UTC +00:00]]

  def complete
        @todo_item = @todo_list.todo_items.find(params[:id])
        @todo_item.update_attribute(:completed_at, Time.now)
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", "1"]]
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = 1  [["completed_at", Sat, 29 Nov 2014 18:51:36 UTC +00:00], ["updated_at", Sat, 29 Nov 2014 18:51:36 UTC +00:00]]

  def find_todo_list
    @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]