app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "first_name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 01 Dec 2014 21:05:13 UTC +00:00], ["first_name", "MyString"], ["updated_at", Mon, 01 Dec 2014 21:05:13 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save